-*- org-image-actual-width: nil; -*-
#+TITLE: =udemy-kafka=

**** Kafka Topics CLI
:PROPERTIES:
:CREATED:  [2021-10-31 Sun 15:20]
:END:

- =kafka-topics= command

- Create a topic

  #+begin_src sh
    kafka-topics.sh \
        --bootstrap-server localhost:9092 \
        --topic first_topic \
        --create \
        --partitions 3 \
        --replication-factor 1
  #+end_src

  You can't have a replication factor higher than the number of
  brokers, of course. Here we have started only one broker so the RF
  will be 1.

- List all existing topics

  #+begin_src sh
    kafka-topics.sh \
        --bootstrap-server localhost:9092 \
        --list
  #+end_src

  #+RESULTS:
  : first_topic

- Describe a topic

  #+begin_src sh :exports both
    kafka-topics.sh \
        --bootstrap-server localhost:9092 \
        --topic first_topic \
        --describe
  #+end_src

  #+RESULTS:
  | Topic: first_topic | TopicId: bPnPJ9wBSMWYDix5aA4Ryg | PartitionCount: 3 | ReplicationFactor: 1 | Configs: segment.bytes=1073741824 |        |
  |                    | Topic: first_topic              | Partition: 0      | Leader: 0            | Replicas: 0                       | Isr: 0 |
  |                    | Topic: first_topic              | Partition: 1      | Leader: 0            | Replicas: 0                       | Isr: 0 |
  |                    | Topic: first_topic              | Partition: 2      | Leader: 0            | Replicas: 0                       | Isr: 0 |

  =Leader: 0= means that broker with ID 0 is the leader for that
  partition.

- Delete a topic (after creating it for that purpose)

  #+begin_src sh
    kafka-topics.sh \
        --bootstrap-server localhost:9092 \
        --topic second_topic \
        --create \
        --partitions 3 \
        --replication-factor 1
  #+end_src

  #+begin_src sh
    kafka-topics.sh \
        --bootstrap-server localhost:9092 \
        --topic second_topic \
        --delete
  #+end_src

**** Kafka consumers groups CLI
:PROPERTIES:
:CREATED:  [2021-10-14 jeu. 20:40]
:END:

- Command =kafka-consumer-groups=

- List all consumer groups, describe a consumer group, delete consumer
  group info, reset consumer group offsets.

- List consumer groups

  #+begin_src sh :exports both
    kafka-consumer-groups.sh \
        --bootstrap-server localhost:9092 \
        --list
  #+end_src

  #+RESULTS:
  | my-first-app  |
  | my-second-app |

- Describe a consumer group

  #+name: describe-consumer-group
  #+begin_src sh :exports both
    kafka-consumer-groups.sh \
            --bootstrap-server localhost:9092 \
            --describe \
            --group my-first-app
  #+end_src

  #+RESULTS:
  | GROUP        | TOPIC       | PARTITION | CURRENT-OFFSET | LOG-END-OFFSET | LAG | CONSUMER-ID | HOST | CLIENT-ID |
  | my-first-app | first_topic |         0 |              2 |              2 |   0 | -           | -    | -         |
  | my-first-app | first_topic |         1 |              1 |              1 |   0 | -           | -    | -         |
  | my-first-app | first_topic |         2 |              3 |              3 |   0 | -           | -    | -         |

  There is also a message in the CLI:

  #+begin_quote
  Consumer group 'my-first-app' has no active members.
  #+end_quote

  This is because we have stopped all console consumers.

- We can create lag by sending messages without any active member in
  the consumer group. Here I sent two message. Then, there will be a
  lag when the describe the group:

  #+call: describe-consumer-group()

  #+RESULTS:
  |              |             |           |                |                |     |             |      |           |
  | GROUP        | TOPIC       | PARTITION | CURRENT-OFFSET | LOG-END-OFFSET | LAG | CONSUMER-ID | HOST | CLIENT-ID |
  | my-first-app | first_topic |         0 |              2 |              3 |   1 | -           | -    | -         |
  | my-first-app | first_topic |         1 |              1 |              1 |   0 | -           | -    | -         |
  | my-first-app | first_topic |         2 |              3 |              4 |   1 | -           | -    | -         |

  We can catch up by launching a consumer. Then:

  #+call: describe-consumer-group()

  #+RESULTS:
  |              |             |           |                |                |     |             |      |           |
  | GROUP        | TOPIC       | PARTITION | CURRENT-OFFSET | LOG-END-OFFSET | LAG | CONSUMER-ID | HOST | CLIENT-ID |
  | my-first-app | first_topic |         0 |              3 |              3 |   0 | -           | -    | -         |
  | my-first-app | first_topic |         1 |              1 |              1 |   0 | -           | -    | -         |
  | my-first-app | first_topic |         2 |              4 |              4 |   0 | -           | -    | -         |

- The description of group with an active consumer will yield IDs:

  Let's start a consumer:

  #+begin_src sh
    kafka-console-consumer.sh \
        --bootstrap-server localhost:9092 \
        --topic first_topic \
        --group my-first-app
  #+end_src

  Now if we describe its consumer group we obtain a consumer ID
  associated to the group:

  #+call: describe-consumer-group()

  #+RESULTS:
  |              |             |           |                |                |     |                                                              |            |                         |
  | GROUP        | TOPIC       | PARTITION | CURRENT-OFFSET | LOG-END-OFFSET | LAG | CONSUMER-ID                                                  | HOST       | CLIENT-ID               |
  | my-first-app | first_topic |         0 |              3 |              3 |   0 | consumer-my-first-app-1-a43b3b38-2f16-472b-836f-4fadf90b0260 | /127.0.0.1 | consumer-my-first-app-1 |
  | my-first-app | first_topic |         1 |              1 |              1 |   0 | consumer-my-first-app-1-a43b3b38-2f16-472b-836f-4fadf90b0260 | /127.0.0.1 | consumer-my-first-app-1 |
  | my-first-app | first_topic |         2 |              4 |              4 |   0 | consumer-my-first-app-1-a43b3b38-2f16-472b-836f-4fadf90b0260 | /127.0.0.1 | consumer-my-first-app-1 |

**** Java consumer inside consumer group
:PROPERTIES:
:CREATED:  [2021-11-02 Tue 19:10]
:END:

- =ConsumerDemoGroups=

- Let's describe the group:

  #+begin_src sh :exports both
    kafka-consumer-groups.sh \
        --bootstrap-server localhost:9092 \
        --group my-java-app \
        --describe
  #+end_src

  #+RESULTS:
  |             |             |           |                |                |     |             |      |           |
  | GROUP       | TOPIC       | PARTITION | CURRENT-OFFSET | LOG-END-OFFSET | LAG | CONSUMER-ID | HOST | CLIENT-ID |
  | my-java-app | first_topic |         0 |             15 |             15 |   0 | -           | -    | -         |
  | my-java-app | first_topic |         1 |             18 |             18 |   0 | -           | -    | -         |
  | my-java-app | first_topic |         2 |             37 |             37 |   0 | -           | -    | -         |

  -> 0 lag.

- Changing the groupId would consume everything again (since
  =AUTO_OFFSET_RESET_CONFIG= is =earliest=)

- When starting multiple consumers in the same group, Kafka do some
  rebalancing. This also happens with a Java program. If we launch
  another Java consumer in the group, in the first consumer's logs we
  see this:

  #+begin_example
    [main] INFO Attempt to heartbeat failed since group is rebalancing
    [main] INFO Revoke previously assigned partitions first_topic-0, first_topic-1, first_topic-2
    [main] INFO (Re-)joining group
    [...]
    [main] INFO Notifying assignor about the new Assignment(partitions=[first_topic-0, first_topic-1])
    [main] INFO Adding newly assigned partitions: first_topic-0, first_topic-1
  #+end_example

  And in the second consumer log's:

  #+begin_example
    [main] INFO Subscribed to topic(s): first_topic
    [main] INFO Cluster ID: cn--pJwYR_ej1zXOdmmELg
    [main] INFO Discovered group coordinator debian.debian:9092 (id: 2147483647 rack: null)
    [main] INFO (Re-)joining group
    [main] INFO (Re-)joining group
    [...]
    [main] INFO Notifying assignor about the new Assignment(partitions=[first_topic-2])
    [main] INFO Adding newly assigned partitions: first_topic-2
  #+end_example

  So the first consumer is now assigned partitions =first_topic-0= and
  =first_topic-1=, and the second one, partition =first_topic-2=.

- We can test this with the producer (=ProducerDemoWithKeys=).

  In the first consumer (partitions 0 and 1):

  #+begin_example
    [main] INFO Partition: 0, offset: 15
    Key: id_1, value: hello world from Java #1
    [main] INFO Partition: 0, offset: 16
    Key: id_3, value: hello world from Java #3
    [main] INFO Partition: 0, offset: 17
    Key: id_6, value: hello world from Java #6
    [main] INFO Partition: 1, offset: 18
    Key: id_8, value: hello world from Java #8
  #+end_example

  In the second one (partition 2):

  #+begin_example
    [main] INFO Partition: 2, offset: 37
    Key: id_2, value: hello world from Java #2
    [main] INFO Partition: 2, offset: 38
    Key: id_4, value: hello world from Java #4
    [main] INFO Partition: 2, offset: 39
    Key: id_5, value: hello world from Java #5
    [main] INFO Partition: 2, offset: 40
    Key: id_7, value: hello world from Java #7
    [main] INFO Partition: 2, offset: 41
    Key: id_9, value: hello world from Java #9
    [main] INFO Partition: 2, offset: 42
    Key: id_10, value: hello world from Java #10
  #+end_example

- The same would happen with a third consumer: each consumer would be
  assigned a partition.

- When the second consumer is stopped, the first consumer's logs
  output these lines:

  #+begin_example
    [main] INFO Attempt to heartbeat failed since group is rebalancing
    [main] INFO Revoke previously assigned partitions first_topic-0, first_topic-1
    [main] INFO (Re-)joining group
    [...]
    [main] INFO Notifying assignor about the new Assignment(partitions=[first_topic-0, first_topic-1, first_topic-2])
    [main] INFO Adding newly assigned partitions: first_topic-0, first_topic-1, first_topic-2
  #+end_example

